---
type: ScheduleFieldId
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ScheduleFieldId

`Autodesk.Revit.DB.ScheduleFieldId` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ScheduleFieldId | 2013 | `public ScheduleFieldId ( int id )` |
| Method | Equals | — | `public override bool Equals ( Object obj )` |
| Method | GetHashCode | — | `public override int GetHashCode ()` |
| Method | ToString | — | `public override string ToString ()` |
| Property | IntegerValue | 2013 | `public int IntegerValue { get ; }` |
| Property | InvalidScheduleFieldId | — | `public static ScheduleFieldId InvalidScheduleFieldId { get ; }` |